
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 20 to add, 9 to change, 6 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.et_shared_postgres_host_v15
  * azurerm_key_vault_secret.et_shared_postgres_password_v15
  * azurerm_key_vault_secret.et_shared_postgres_port_v15
  * azurerm_key_vault_secret.et_shared_postgres_user_v15
  * module.postgres.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgres.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgres.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgres.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgres.azurerm_postgresql_flexible_server_database.pg_databases[&#34;et_cos&#34;]
  * module.postgres.azurerm_postgresql_flexible_server_database.pg_databases[&#34;et_msg_handler&#34;]
  * module.postgres.azurerm_resource_group.rg[0]
  * module.postgres.null_resource.set-user-permissions-additionaldbs[&#34;et_cos&#34;]
  * module.postgres.null_resource.set-user-permissions-additionaldbs[&#34;et_msg_handler&#34;]
  * module.postgres.random_password.password
* Update
  * azurerm_application_insights.appinsights
  * azurerm_key_vault_secret.create_updates_queue_listen_conn_str
  * azurerm_key_vault_secret.create_updates_queue_send_conn_str
  * azurerm_key_vault_secret.update_case_queue_send_conn_str
  * azurerm_resource_group.rg
  * module.et-key-vault.azurerm_key_vault.kv
  * module.et-key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.et-key-vault.azurerm_user_assigned_identity.managed_identity[0]
  * module.servicebus-namespace-ret3725.azurerm_servicebus_namespace.servicebus_namespace
* Replace
  * module.create-updates-queue-ret3725.azurerm_servicebus_queue.servicebus_queue
  * module.create-updates-queue-ret3725.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.create-updates-queue-ret3725.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.update-case-queue-ret3725.azurerm_servicebus_queue.servicebus_queue
  * module.update-case-queue-ret3725.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.update-case-queue-ret3725.azurerm_servicebus_queue_authorization_rule.send_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.Insights/components/et-aat"
        name                                  = "et-aat"
      ~ tags                                  = {
            "application"         = "employment-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals"
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.create_updates_queue_listen_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_listen_conn_str" {
        id                      = "https://et-aat.vault.azure.net/secrets/create-updates-queue-listen-connection-string/a2a81e7df3de49a8ac860e071911c664"
        name                    = "create-updates-queue-listen-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.create_updates_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_send_conn_str" {
        id                      = "https://et-aat.vault.azure.net/secrets/create-updates-queue-send-connection-string/08db17356375499cb5e75bd04a1b348e"
        name                    = "create-updates-queue-send-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.et_shared_postgres_host_v15 will be created
  + resource "azurerm_key_vault_secret" "et_shared_postgres_host_v15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat"
      + name                    = "et-shared-postgres-host-v15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.et_shared_postgres_password_v15 will be created
  + resource "azurerm_key_vault_secret" "et_shared_postgres_password_v15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat"
      + name                    = "et-shared-postgres-password-v15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.et_shared_postgres_port_v15 will be created
  + resource "azurerm_key_vault_secret" "et_shared_postgres_port_v15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat"
      + name                    = "et-shared-postgres-port-v15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.et_shared_postgres_user_v15 will be created
  + resource "azurerm_key_vault_secret" "et_shared_postgres_user_v15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat"
      + name                    = "et-shared-postgres-user-v15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.update_case_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update_case_queue_send_conn_str" {
        id                      = "https://et-aat.vault.azure.net/secrets/update-case-queue-send-connection-string/e794c22d00d84a79ad3fbb61ef29b197"
        name                    = "update-case-queue-send-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat"
        name     = "et-aat"
      ~ tags     = {
            "application"         = "employment-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals"
        }
        # (1 unchanged attribute hidden)
    }

  # module.create-updates-queue-ret3725.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "et-sb-aat"
      + resource_group_name                 = "et-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.create-updates-queue-ret3725.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/create-updates" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "create-updates"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat" # forces replacement -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.create-updates-queue-ret3725.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/create-updates/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/create-updates" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.create-updates-queue-ret3725.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/create-updates/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/create-updates" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.et-key-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat"
        name                            = "et-aat"
      ~ tags                            = {
            "application"         = "employment-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.et-key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat|et-aat"
        name                           = "et-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.et-key-vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/et-aat-mi"
        name                = "et-aat-mi"
      ~ tags                = {
            "application"         = "employment-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals"
        }
        # (5 unchanged attributes hidden)
    }

  # module.postgres.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "et-shared-postgres-v15-aat"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "et-shared-postgres-v15-data-aat"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "Destroy Me"   = "No"
          + "Team Contact" = "#et-tech"
          + "application"  = "et"
          + "builtFrom"    = "https://github.com/HMCTS/et-shared-infrastructure.git"
          + "businessArea" = "CFT"
          + "environment"  = "staging"
          + "managedBy"    = "Employment Tribunals"
        }
      + version                       = "15"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgres.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "et-shared-postgres-v15-data-aat"
      + server_name         = "et-shared-postgres-v15-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgres.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "et-shared-postgres-v15-data-aat"
      + server_name         = "et-shared-postgres-v15-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgres.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgres.azurerm_postgresql_flexible_server_database.pg_databases["et_cos"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "et_cos"
      + server_id = (known after apply)
    }

  # module.postgres.azurerm_postgresql_flexible_server_database.pg_databases["et_msg_handler"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "et_msg_handler"
      + server_id = (known after apply)
    }

  # module.postgres.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "et-shared-postgres-v15-data-aat"
      + tags     = {
          + "Destroy Me"   = "No"
          + "Team Contact" = "#et-tech"
          + "application"  = "et"
          + "builtFrom"    = "https://github.com/HMCTS/et-shared-infrastructure.git"
          + "businessArea" = "CFT"
          + "environment"  = "staging"
          + "managedBy"    = "Employment Tribunals"
        }
    }

  # module.postgres.null_resource.set-user-permissions-additionaldbs["et_cos"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "name"           = "et-shared-postgres-v15"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

  # module.postgres.null_resource.set-user-permissions-additionaldbs["et_msg_handler"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "name"           = "et-shared-postgres-v15"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

  # module.postgres.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.servicebus-namespace-ret3725.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat"
        name                                = "et-sb-aat"
      ~ tags                                = {
            "application"         = "employment-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.update-case-queue-ret3725.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "et-sb-aat"
      + resource_group_name                 = "et-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.update-case-queue-ret3725.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/update-case" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "update-case"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat" # forces replacement -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.update-case-queue-ret3725.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/update-case/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/update-case" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.update-case-queue-ret3725.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/update-case/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/update-case" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

Plan: 20 to add, 9 to change, 6 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":45,"Program":"tfcmt","SHA1":"","Vars":{}} -->